garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F25Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MDCARHPPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="MDCARHPPS" edc:nzwidth="8" edc:por="---00100" edc:_addr="0xEAE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCARHPPS0" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS1" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS2" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS3" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS4" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDCARHPPS" edc:mask="0x1f" edc:name="MDCARHPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MDSRCPPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="MDSRCPPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xEAF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDSRCPPS0" edc:mask="0x1" edc:name="MDSRCPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCPPS1" edc:mask="0x1" edc:name="MDSRCPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCPPS2" edc:mask="0x1" edc:name="MDSRCPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCPPS3" edc:mask="0x1" edc:name="MDSRCPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCPPS4" edc:mask="0x1" edc:name="MDSRCPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDSRCPPS" edc:mask="0x1f" edc:name="MDSRCPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RX1PPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RX1PPS" edc:nzwidth="8" edc:por="---10111" edc:_addr="0xEB0">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RXPPS"/>
            <edc:LegacyAlias edc:cname="RXDT1PPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXPPS0" edc:mask="0x1" edc:name="RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXPPS1" edc:mask="0x1" edc:name="RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXPPS2" edc:mask="0x1" edc:name="RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXPPS3" edc:mask="0x1" edc:name="RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXPPS4" edc:mask="0x1" edc:name="RXPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RXPPS" edc:mask="0x1f" edc:name="RXPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CK1PPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CK1PPS" edc:nzwidth="8" edc:por="---10110" edc:_addr="0xEB1">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TXPPS"/>
            <edc:LegacyAlias edc:cname="CKPPS"/>
            <edc:LegacyAlias edc:cname="TXCK1PPS"/>
            <edc:LegacyAlias edc:cname="TX1PPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXPPS0" edc:mask="0x1" edc:name="TXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPPS1" edc:mask="0x1" edc:name="TXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPPS2" edc:mask="0x1" edc:name="TXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPPS3" edc:mask="0x1" edc:name="TXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPPS4" edc:mask="0x1" edc:name="TXPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TXPPS" edc:mask="0x1f" edc:name="TXPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSP1CLKPPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSP1CLKPPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xEB2">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPCLKPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPCLKPPS0" edc:mask="0x1" edc:name="SSPCLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS1" edc:mask="0x1" edc:name="SSPCLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS2" edc:mask="0x1" edc:name="SSPCLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS3" edc:mask="0x1" edc:name="SSPCLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS4" edc:mask="0x1" edc:name="SSPCLKPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP1CLKPPS" edc:mask="0x1f" edc:name="SSP1CLKPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP1CLKPPS0" edc:mask="0x1" edc:name="SSP1CLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1CLKPPS1" edc:mask="0x1" edc:name="SSP1CLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1CLKPPS2" edc:mask="0x1" edc:name="SSP1CLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1CLKPPS3" edc:mask="0x1" edc:name="SSP1CLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1CLKPPS4" edc:mask="0x1" edc:name="SSP1CLKPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="SSPCLKPPS" edc:mask="0x1f" edc:name="SSPCLKPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSP1DATPPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSP1DATPPS" edc:nzwidth="8" edc:por="---10100" edc:_addr="0xEB3">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPDATPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPDATPPS0" edc:mask="0x1" edc:name="SSPDATPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS1" edc:mask="0x1" edc:name="SSPDATPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS2" edc:mask="0x1" edc:name="SSPDATPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS3" edc:mask="0x1" edc:name="SSPDATPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS4" edc:mask="0x1" edc:name="SSPDATPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP1DATPPS" edc:mask="0x1f" edc:name="SSP1DATPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP1DATPPS0" edc:mask="0x1" edc:name="SSP1DATPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1DATPPS1" edc:mask="0x1" edc:name="SSP1DATPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1DATPPS2" edc:mask="0x1" edc:name="SSP1DATPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1DATPPS3" edc:mask="0x1" edc:name="SSP1DATPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1DATPPS4" edc:mask="0x1" edc:name="SSP1DATPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="SSPDATPPS" edc:mask="0x1f" edc:name="SSPDATPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSP1SSPPS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSP1SSPPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xEB4">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPSSPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPSSPPS0" edc:mask="0x1" edc:name="SSPSSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS1" edc:mask="0x1" edc:name="SSPSSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS2" edc:mask="0x1" edc:name="SSPSSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS3" edc:mask="0x1" edc:name="SSPSSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS4" edc:mask="0x1" edc:name="SSPSSPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP1SSPPS" edc:mask="0x1f" edc:name="SSP1SSPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP1SSPPS0" edc:mask="0x1" edc:name="SSP1SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1SSPPS1" edc:mask="0x1" edc:name="SSP1SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1SSPPS2" edc:mask="0x1" edc:name="SSP1SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1SSPPS3" edc:mask="0x1" edc:name="SSP1SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1SSPPS4" edc:mask="0x1" edc:name="SSP1SSPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="SSPSSPPS" edc:mask="0x1f" edc:name="SSPSSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="IPR0" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--11-111" edc:name="IPR0" edc:nzwidth="8" edc:por="--11-111" edc:_addr="0xEB5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IP" edc:mask="0x1" edc:name="INT0IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IP" edc:mask="0x1" edc:name="INT1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2IP" edc:mask="0x1" edc:name="INT2IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCIP" edc:mask="0x1" edc:name="IOCIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IP" edc:mask="0x1" edc:name="TMR0IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="IPR1" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11----11" edc:name="IPR1" edc:nzwidth="8" edc:por="11----11" edc:_addr="0xEB6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADIP" edc:mask="0x1" edc:name="ADIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADTIP" edc:mask="0x1" edc:name="ADTIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CSWIP" edc:mask="0x1" edc:name="CSWIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSCFIP" edc:mask="0x1" edc:name="OSCFIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="IPR2" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11----11" edc:name="IPR2" edc:nzwidth="8" edc:por="11----11" edc:_addr="0xEB7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1IP" edc:mask="0x1" edc:name="C1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2IP" edc:mask="0x1" edc:name="C2IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ZCDIP" edc:mask="0x1" edc:name="ZCDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIP" edc:mask="0x1" edc:name="HLVDIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
