garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F25Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ADCAP" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="ADCAP" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF58">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCAP" edc:desc="" edc:mask="0x1f" edc:name="ADCAP" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCAP0" edc:desc="" edc:mask="0x1" edc:name="ADCAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP1" edc:desc="" edc:mask="0x1" edc:name="ADCAP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP2" edc:desc="" edc:mask="0x1" edc:name="ADCAP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP3" edc:desc="" edc:mask="0x1" edc:name="ADCAP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP4" edc:desc="" edc:mask="0x1" edc:name="ADCAP4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADPRE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADPRE" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF59">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPRE" edc:desc="" edc:mask="0xff" edc:name="ADPRE" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPRE0" edc:desc="" edc:mask="0x1" edc:name="ADPRE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE1" edc:desc="" edc:mask="0x1" edc:name="ADPRE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE2" edc:desc="" edc:mask="0x1" edc:name="ADPRE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE3" edc:desc="" edc:mask="0x1" edc:name="ADPRE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE4" edc:desc="" edc:mask="0x1" edc:name="ADPRE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE5" edc:desc="" edc:mask="0x1" edc:name="ADPRE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE6" edc:desc="" edc:mask="0x1" edc:name="ADPRE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE7" edc:desc="" edc:mask="0x1" edc:name="ADPRE7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADPCH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADPCH" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF5A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPCH" edc:desc="" edc:mask="0x3f" edc:name="ADPCH" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPCH0" edc:desc="" edc:mask="0x1" edc:name="ADPCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH1" edc:desc="" edc:mask="0x1" edc:name="ADPCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH2" edc:desc="" edc:mask="0x1" edc:name="ADPCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH3" edc:desc="" edc:mask="0x1" edc:name="ADPCH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH4" edc:desc="" edc:mask="0x1" edc:name="ADPCH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH5" edc:desc="" edc:mask="0x1" edc:name="ADPCH5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-n-n-n" edc:cname="ADCON0" edc:desc="" edc:impl="0xd5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0-0-0" edc:name="ADCON0" edc:nzwidth="0x8" edc:por="00-0-0-0" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF5B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADGO" edc:desc="" edc:mask="0x1" edc:name="ADGO" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS" edc:desc="" edc:mask="0x1" edc:name="ADCS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCONT" edc:desc="" edc:mask="0x1" edc:name="ADCONT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="GO" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADFM0" edc:desc="" edc:mask="0x1" edc:name="ADFM0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DONE" edc:mask="0x1" edc:name="DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:mask="0x1" edc:name="GO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="ADCAL" edc:desc="" edc:mask="0x1" edc:name="ADCAL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="ADPREV" edc:desc="" edc:name="ADPREV" edc:nzwidth="0x10" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF5C">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADPREVL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADPREVL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF5C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADPREVL" edc:desc="" edc:mask="0xff" edc:name="ADPREVL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADPREV0" edc:desc="" edc:mask="0x1" edc:name="ADPREV0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV1" edc:desc="" edc:mask="0x1" edc:name="ADPREV1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV2" edc:desc="" edc:mask="0x1" edc:name="ADPREV2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV3" edc:desc="" edc:mask="0x1" edc:name="ADPREV3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV4" edc:desc="" edc:mask="0x1" edc:name="ADPREV4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV5" edc:desc="" edc:mask="0x1" edc:name="ADPREV5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV6" edc:desc="" edc:mask="0x1" edc:name="ADPREV6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV7" edc:desc="" edc:mask="0x1" edc:name="ADPREV7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADPREVH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADPREVH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF5D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADPREVH" edc:desc="" edc:mask="0xff" edc:name="ADPREVH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADPREV8" edc:desc="" edc:mask="0x1" edc:name="ADPREV8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV9" edc:desc="" edc:mask="0x1" edc:name="ADPREV9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV10" edc:desc="" edc:mask="0x1" edc:name="ADPREV10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV11" edc:desc="" edc:mask="0x1" edc:name="ADPREV11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV12" edc:desc="" edc:mask="0x1" edc:name="ADPREV12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV13" edc:desc="" edc:mask="0x1" edc:name="ADPREV13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV14" edc:desc="" edc:mask="0x1" edc:name="ADPREV14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV15" edc:desc="" edc:mask="0x1" edc:name="ADPREV15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADRES" edc:desc="" edc:name="ADRES" edc:nzwidth="0x10" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF5E">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRESL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADRESL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF5E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESL" edc:desc="" edc:mask="0xff" edc:name="ADRESL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADRES0" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES1" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES2" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES3" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES4" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES5" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES6" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES7" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
