garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F25Q10.PIC
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="T1CON" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uu-u0u" edc:name="T1CON" edc:nzwidth="8" edc:por="--00-000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFCE">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR1CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD16" edc:desc="" edc:mask="0x1" edc:name="RD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOT_SYNC" edc:desc="" edc:mask="0x1" edc:name="NOT_SYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x3" edc:name="CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR1ON" edc:mask="0x1" edc:name="TMR1ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1RD16" edc:mask="0x1" edc:name="T1RD16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_T1SYNC" edc:mask="0x1" edc:name="NOT_T1SYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKPS0" edc:desc="" edc:mask="0x1" edc:name="T1CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKPS1" edc:desc="" edc:mask="0x1" edc:name="T1CKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nSYNC" edc:mask="0x1" edc:name="nSYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RD161" edc:desc="" edc:mask="0x1" edc:name="RD161" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nT1SYNC" edc:mask="0x1" edc:name="nT1SYNC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnr--" edc:cname="T1GCON" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuux--" edc:name="T1GCON" edc:nzwidth="8" edc:por="00000x--" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFCF">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR1GCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GVAL" edc:desc="" edc:mask="0x1" edc:name="GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GGO" edc:desc="" edc:mask="0x1" edc:name="GGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GSPM" edc:desc="" edc:mask="0x1" edc:name="GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GTM" edc:desc="" edc:mask="0x1" edc:name="GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GPOL" edc:desc="" edc:mask="0x1" edc:name="GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GE" edc:desc="" edc:mask="0x1" edc:name="GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="T1GVAL" edc:mask="0x1" edc:name="T1GVAL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GGO" edc:desc="" edc:mask="0x1" edc:name="T1GGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GSPM" edc:mask="0x1" edc:name="T1GSPM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GTM" edc:mask="0x1" edc:name="T1GTM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPOL" edc:mask="0x1" edc:name="T1GPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GE" edc:mask="0x1" edc:name="T1GE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_DONE" edc:mask="0x1" edc:name="NOT_DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_T1DONE" edc:mask="0x1" edc:name="NOT_T1DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="GGO_nDONE" edc:mask="0x1" edc:name="GGO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="T1GGO_nDONE" edc:mask="0x1" edc:name="T1GGO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T1GATE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="T1GATE" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFD0">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR1GATE"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GSS" edc:mask="0xf" edc:name="GSS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="GSS0" edc:mask="0x1" edc:name="GSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS1" edc:mask="0x1" edc:name="GSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS2" edc:mask="0x1" edc:name="GSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS3" edc:mask="0x1" edc:name="GSS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1GSS0" edc:mask="0x1" edc:name="T1GSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GSS1" edc:mask="0x1" edc:name="T1GSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GSS2" edc:mask="0x1" edc:name="T1GSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GSS3" edc:mask="0x1" edc:name="T1GSS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T1CLK" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="T1CLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFD1">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR1CLK"/>
            <edc:LegacyAlias edc:cname="PR1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:mask="0xf" edc:name="CS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1CS0" edc:mask="0x1" edc:name="T1CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CS1" edc:mask="0x1" edc:name="T1CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CS2" edc:mask="0x1" edc:name="T1CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CS3" edc:mask="0x1" edc:name="T1CS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR0L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xFD2">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0L" edc:desc="" edc:mask="0xff" edc:name="TMR0L" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR0L0" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L1" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L2" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L3" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L4" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L5" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L6" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L7" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TMR0H" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xFD3">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PR0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0H" edc:mask="0xff" edc:name="TMR0H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="T0PR" edc:mask="0xff" edc:name="T0PR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR0H0" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H1" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H2" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H3" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H4" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H5" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H6" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H7" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T0PR0" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR1" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR2" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR3" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR4" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR5" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR6" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR7" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="T0CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="T0CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xFD4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T0OUTPS" edc:desc="" edc:mask="0xf" edc:name="T0OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="T016BIT" edc:desc="" edc:mask="0x1" edc:name="T016BIT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0OUT" edc:desc="" edc:mask="0x1" edc:name="T0OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T0EN" edc:desc="" edc:mask="0x1" edc:name="T0EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0OUTPS0" edc:mask="0x1" edc:name="T0OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS1" edc:mask="0x1" edc:name="T0OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS2" edc:mask="0x1" edc:name="T0OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS3" edc:mask="0x1" edc:name="T0OUTPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T0CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T0CON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xFD5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T0CKPS" edc:desc="" edc:mask="0xf" edc:name="T0CKPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="T0ASYNC" edc:desc="" edc:mask="0x1" edc:name="T0ASYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CS" edc:desc="" edc:mask="0x7" edc:name="T0CS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0CKPS0" edc:mask="0x1" edc:name="T0CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS1" edc:mask="0x1" edc:name="T0CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS2" edc:mask="0x1" edc:name="T0CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS3" edc:mask="0x1" edc:name="T0CKPS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS0" edc:desc="" edc:mask="0x1" edc:name="T0CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CS1" edc:desc="" edc:mask="0x1" edc:name="T0CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CS2" edc:desc="" edc:mask="0x1" edc:name="T0CS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T0PS0" edc:mask="0x1" edc:name="T0PS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PS1" edc:mask="0x1" edc:name="T0PS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PS2" edc:mask="0x1" edc:name="T0PS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PS3" edc:mask="0x1" edc:name="T0PS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T0PS" edc:mask="0xf" edc:name="T0PS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----n-n" edc:cname="PCON1" edc:desc="" edc:impl="0x5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----q-q" edc:name="PCON1" edc:nzwidth="8" edc:por="-----1-1" edc:_addr="0xFD6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RCM" edc:mask="0x1" edc:name="RCM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RVREG" edc:mask="0x1" edc:name="RVREG" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="nRCM" edc:mask="0x1" edc:name="nRCM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="nRVREG" edc:mask="0x1" edc:name="nRVREG" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqquu" edc:name="PCON0" edc:nzwidth="8" edc:por="0011110q" edc:_addr="0xFD7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="nBOR" edc:mask="0x1" edc:name="nBOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPOR" edc:mask="0x1" edc:name="nPOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nRI" edc:mask="0x1" edc:name="nRI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nRMCLR" edc:mask="0x1" edc:name="nRMCLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nRWDT" edc:mask="0x1" edc:name="nRWDT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nWDTWV" edc:mask="0x1" edc:name="nWDTWV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STKUNF" edc:mask="0x1" edc:name="STKUNF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STKOVF" edc:mask="0x1" edc:name="STKOVF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BOR" edc:mask="0x1" edc:name="BOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POR" edc:mask="0x1" edc:name="POR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RI" edc:mask="0x1" edc:name="RI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RMCLR" edc:mask="0x1" edc:name="RMCLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RWDT" edc:mask="0x1" edc:name="RWDT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTWV" edc:mask="0x1" edc:name="WDTWV" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrnnnnn" edc:cname="STATUS" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="-qquuuuu" edc:name="STATUS" edc:nzwidth="0x8" edc:por="-1100000" edc:_addr="0xFD8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:desc="" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPD" edc:mask="0x1" edc:name="nPD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nTO" edc:mask="0x1" edc:name="nTO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="PD" edc:mask="0x1" edc:name="PD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TO" edc:mask="0x1" edc:name="TO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="FSR2" edc:desc="" edc:name="FSR2" edc:nzwidth="0x10" edc:_addr="0xFD9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR2" edc:desc="" edc:mask="0xfff" edc:name="FSR2" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="FSR2L" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFD9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR2L" edc:desc="" edc:mask="0xff" edc:name="FSR2L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="FSR2H" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="false" edc:mclr="----0000" edc:name="FSR2H" edc:nzwidth="0x8" edc:por="----0000" edc:_addr="0xFDA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR2H" edc:desc="" edc:islanghidden="true" edc:mask="0xf" edc:name="FSR2H" edc:nzwidth="4"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
